ЧартерEDT.Расширение1/src/Documents/AddRoom/AddRoom.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8b656dee-633d-406a-9c03-d9def325700e">
  <name>AddRoom</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="8f316e9e-522f-4ea8-a511-8e394c8f0f91">
    <name>Room</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8a9af351-1ed8-47e8-a4ac-36ccb9a9133b">
    <name>RoomGroup</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d4544252-6dc6-4e47-a5ba-9a077088c026">
    <name>RoomNumber</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="35d7b095-2084-4ac5-b1c0-53496259e3c0">
    <name>SortCode</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="94d9082d-081d-4e09-8241-03b5bd703e48">
    <name>NumberOfBedsPerRoom</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="61d78b1e-fc72-4b03-bbda-4ac551278501">
    <name>NumberOfPersonsPerRoom</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d0dc231c-4c6d-423c-9c13-21128a11e0b6">
    <name>RoomType</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерКвартиры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="42582061-eefa-4e14-aef3-282e5f7e8213">
    <name>Hotel</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6c2ae375-5c01-49ac-b86e-b29e738fa70f">
    <name>IsVirtual</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7137f8ea-52d7-42de-8bce-891d9c49f707">
    <name>OperationEndDate</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e2f25bda-a969-4a7c-8153-6e2742fc9d69">
    <name>Remarks</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4e5dce1b-2144-473e-b535-33b9ac3e3b0b">
    <name>Author</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

ЧартерEDT.Расширение1/src/Documents/AddRoom/ObjectModule.bsl
&ChangeAndValidate("FillRoomAttributes")
Procedure Расш1_FillRoomAttributes(pRoomObj)
	pRoomObj.Owner = Hotel;
	pRoomObj.Description = RoomNumber;
	pRoomObj.Parent = RoomGroup;
	pRoomObj.RoomType = RoomType;
	pRoomObj.NumberOfBedsPerRoom = NumberOfBedsPerRoom;
	pRoomObj.NumberOfPersonsPerRoom = NumberOfPersonsPerRoom;
	pRoomObj.OperationEndDate = OperationEndDate;
	pRoomObj.SortCode = SortCode;
	#Вставка
	pRoomObj.НомерКвартиры = НомерКвартиры;
	#КонецВставки
	If Not IsBlankString(Remarks) Then
		pRoomObj.Remarks = Remarks;
	EndIf;
	pRoomObj.IsVirtual = IsVirtual;
EndProcedure
